— made by { @Mouamle } 
do 
ws = {} 
rs = {} 

— some examples of how to use this :3 
ws[1] = "هلاوو" 
rs[1] = "يا هلا بلعيال💔😹" 

ws[2] = "سبانه" — msg 
rs[2] = "كول حبي اجيك خاص🌚❤️" — reply 

ws[3] = "شلونكم" — msg 
rs[3] = "الحمدلله وانته 🌚🍃" — reply 

ws[4] = "@abo_shosho98" — msg 
rs[4] = "اصبر هسه اصيحه الك💖" — reply 

ws[5] = "شونك" 
rs[5] = "تمام حياتي وانته💋💚" 

ws[6] = "شنو اسمك" 
rs[6] = "ليش تسال" 

ws[7] = "شنو اسمج" 
rs[7] = "بلجنسيه لو هناا🙁😹" 

ws[8] = "شمخلص" 
rs[8] = "والله مخلص 3 مواعين تمن ليش🙁" 

ws[9] = "ديدان" 
rs[9] = "تفضل حياتي بلخدمه😍🖐" 

ws[10] = "سيفي" 
rs[10] = "حبي مشغول تعالي فدشويه 🌚❤️" 

ws[11] = "اي" 
rs[11] = "طبك مرض😹🚶طبك مرض😹🚶"

ws[12] = "ورده" 
rs[12] = "يا ورده منهن الي ع النعال😹"

ws[13] = "ضلعي" 
rs[13] = "منو منهن اليسره لو اليمنه🌚✨" 

ws[14] = "بنات"
rs[14] = "شتريد من البنات 😒🎈"

ws[15] = "شباب" 
rs[15] = "شباب شوي😹💔"

ws[16] = "حمودي" 
rs[16] = "لا ذكروني بحبيبي اني بلكوه نسيته جان دمعه بطرف عيني والحمد لله بجيته 😔#مراجل"

ws[17] = "دي" 
rs[17] = "احترم شويه عود انته الجبير😹💔"

ws[18] = "شوف" 
rs[18] = "شوف لو كطن😹"

ws[19] = "الكروب" 
rs[19] = "شبي ما عاجبك ادعبل🙁💚" 

ws[20] = "احسن" 
rs[20] = "ليش انته منين 😳" 

ws[21] = "😘" 
rs[21] = "عوف التمطك ما تشبع😒" 

ws[22] = "تبادل" 
rs[22] = "دي مناااااا" 

ws[23] = "كافي" 
rs[23] = "كافي لو كيمر 😹كيمر عرب😹عرب جول 😹جول لو هدف😹"

ws[24] = "من وين" 
rs[24] = "من ارض الله الواسعه😻"

ws[25] = "هاي" 
rs[25] = "هاي ابو الهيل💖😂"

ws[26] = "البوت" 
rs[26] = "معاجبك ؟ 😕😒🍃" 

ws[27] = "البوت واكف" 
rs[27] = "لتجذب 😒" 

ws[28] = "منو ديحذف رسائلي" 
rs[28] = "محد 😐🍃" 

ws[29] = "هسه" 
rs[29] = "هسه ارضيه😹"

ws[30] = "تعال" 
rs[30] = "تعال ابو الاصبع😤😹"

ws[31] = "شبيكم" 
rs[31] = "والله مااعرف صالهم ساعه ياكلون خراا😹"

ws[32] = "ها" 
rs[32] = "🌚غلس ليجيك سطل"

ws[33] = "☺️" 
rs[33] = "فديت الخجول🌚☹️" 

ws[34] = "🙈"
rs[34] = "هاا شنو شفت😳💔" 

ws[35] = "مح" 
rs[35] = "فديت المح😍" 

ws[37] = "ابو علوش" 
rs[37] = " 🌝❤️شتريد منه مشغول ؟ " 

ws[38] = "مااعرف" 
rs[38] = "جذاب كلشي يعرف" 

ws[39] = "انتي" 
rs[39] = "شبيها خوش بنيه🌚🌸" 

ws[40] = "ماادري" 
rs[40] = "ادري الجاي😹" 

ws[41] = "تحبني" 
rs[41] = "اكثر من ماتصور😹💔" 

ws[42] = "حديقه" 
rs[42] = "تعال ازرعلك خيار😳😂" 

ws[43] = "😉" 
rs[43] = "عيب استحي😒🖕🏿" 

ws[44] = "هههه" 
rs[44] = "يمه فدوه هل تحكه💖 ❤️" 

ws[45] = "روعه" 
rs[45] = "انته الاصل حبي😂💔" 

ws[46] = "😹" 
rs[46] = " دوم حبي ❤️" 

ws[47] = "😊" 
rs[47] = "فديت الحلو كاتلني🌝💚"

ws[48] = "😍" 
rs[48] = " مح فديتك" 

ws[49] = "خير" 
rs[49] = "منين الخير اذا انته مكابلني😕️" 

ws[50] = "شويه" 
rs[50] = "يعني شكد تريد😕" 

ws[51] = "منحرف" 
rs[51] = " وينه حطرده 🌚🌚" 

ws[52] = "😢" 
rs[52] = "تريد ربع😹😹" 

ws[53] = "😒😒" 
rs[53] = "ورده عدل وجهك😹" 

ws[54] = "هلوات" 
rs[54] = "هلوات ع النبي😂" 

ws[55] = "شلون" 
rs[55] = "اطلع من الحمره😹" 

ws[56] = "منو صنعك" 
rs[56] = "وليد صنعني بس شويه تعب من وراي😔💔" 

ws[57] = "واحد" 
rs[57] = "وين بلحله🌚"

ws[58] = "غنيلي" 
rs[58] = "😹ديدي طب بفرعنه ديدي اشتره كيه😻ديدي اخذله مرة😹ديدي يله جر منااا😹😹"

ws[59] = "احم" 
rs[59] = "ماكل نعل شبيك من الصبح😕" 

ws[60] = "تكرهني" 
rs[60] = " 😈" 

ws[61] = "اكرهك" 
rs[61] = " علساس اني احبك تهي بهي 😒🍃" 

ws[62] = "❤️" 
rs[62] = "عندي واحد ممحتاج😒️" 

ws[63] = "خرب" 
rs[63] = "شنو الخرب😳😳️" 

ws[64] = "صورتك" 
rs[64] = "تعال خاص ادزها الك🌝😹️" 

ws[65] = "فديتك" 
rs[65] = "فداك البوت مال ذاك الكروب😹️" 

ws[66] = "العمر كله" 
rs[66] = "ربي يسلمك😒❤️"

ws[67] = "🌚" 
rs[67] = " الله يبيض وجهك🙁" 

ws[68] = "🌝" 
rs[68] = "طكطكهن حبي🌚🖕🏿" 

ws[69] = "ليش" 
rs[69] = "شعليك/ج انته بكلشي حاشر نفسك😒" 

ws[70] = "😕" 
rs[70] = "تعال خاص💜🌚" 

ws[71] = "تريد" 
rs[71] = " عندك انطيني☹️❤️ " 

ws[72] = "وليد" 
rs[72] = "شتريد وجه التنكه🌝🖕🏿" 

ws[73] = "هه" 
rs[73] = "ع خالتك الشكره😪👟" 

ws[74] = "شدتحس" 
rs[74] = "ادخله واطلعه😎💋" 

ws[75] = "اكلك" 
rs[75] = "انجب وكلشي لتكول😹💔" 

ws[76] = "شبيك" 
rs[76] = "البيه بيك حياتي🐸🚬" 

ws[78] = "ها" 
rs[78] = "ومرض شبيك صيح🌝💚" 

ws[79] = "منوين" 
rs[79] = "ليش لوكي 😃🎈" 

ws[80] = "روعه" 
rs[80] = "منو يكول😼" 

ws[81] = "اني اكول" 
rs[81] = "شعليه بحجي النسوان🤐😹" 

ws[83] = "باي" 
rs[83] = "الله وياك حبي "

ws[84] = "منورين" 
rs[84] = "شعليك انته😹" 

ws[85] = "جوعان" 
rs[85] = "روح " 
للحمام🌚😹
ws[86] = "عطشان" 
rs[86] = "تعال بسرعه محصوربوله😹" 

ws[87] = "نورت" 
rs[87] = "منيله منور وجه وجه الجوب😒" 

ws[88] = "☹️" 
rs[88] = "لتبيع مالاتك هناا ادعبل😪🖐" 

ws[89] = "😔" 
rs[89] = "يا رزاق يا فتاح شكو من الصباحيات🌚" 

ws[90] = "ضايج" 
rs[90] = "تعال العب بلرايج😕😹" 

ws[92] = "اتعرف" 
rs[92] = "دي زاحف ✾ "

ws[93] = "نعال" 
rs[93] = "بحلكك ابن الاوادم يلا ولي😒❤️"

ws[94] = "اريد اكبل" 
rs[94] = "تسكت لو اوكلك جص😕" 

ws[95] = "شكو ماكو" 
rs[95] = "غيرك بلكلب ماكو💚" 

ws[96] = "شكو" 
rs[96] = " لصير حشري بيناتهم😐👟" 

ws[97] = "منو" 
rs[97] = " انته اكو غيرك يعني😃✨" 

ws[98] = "🚶" 
rs[98] = "تعال انطيت فلوس😕" 

ws[99] = "😎" 
rs[99] = "شلون راس بصل😹" 

ws[100] = "منور" 
rs[100] = " بنورك حبي 😍🍷" 

ws[101] = "شبيج" 
rs[101] = "معليك بيها لا اسمعك غير شي😒"

ws[102] = "اجيت" 
rs[102] = "يلا ارجع 😕️" 

ws[103] = "البوت" 
rs[103] = "نعم حبي منو حجه عليه🌚💔" 

ws[104] = "😏" 
rs[104] = "تريد نعال😻" 

ws[105] = "وينه" 
rs[105] = "هذا يمي كاعد🌝" 

ws[106] = "حلو" 
rs[106] = "حلاتك حبي نورت😍" 

ws[107] = "احبك" 
rs[107] = "للموت ماانساك 💋💚" 

ws[108] = "😑" 
rs[108] = "اهووو شبيك بابا ؟️" 

ws[109] = "😒" 
rs[109] = "اجاوزك بااخلاقي😌" 

ws[110] = "مكبل" 
rs[110] = "انته لوكي 😒" 

ws[111] = "نورتي" 
rs[111] = "اني احله منها😪☝️" 

ws[112] = "فديت" 
rs[112] = "🌝🐢ها  زاحف كمشتك" 

ws[113] = "مضغوط" 
rs[113] = "دي انضغظ منك ؟ 😂😂" 

ws[114] = "عليمن" 
rs[114] = "عليك انته اي انته😳🖕🏿" 

ws[115] = "صدك" 
rs[115] = "مشاقي وياك قبل 🙁😹" 

ws[116] = "فديتج" 
rs[116] = "فداك الكون غلاا" 

ws[117] = "شوف خاصك" 
rs[117] = "شدازله 😱😨" 

ws[118] = "تعال خاص" 
rs[118] = " بده الزحف😐😂" 

ws[119] = "خاص" 
rs[119] = "بده الكلان تبن👍"

ws[120] = "سبانه" 
rs[120] = "لضل كلساعه صيح مااشتغل عندك😒💔"

ws[121] = "😎" 
rs[121] = "يلا عود انته فد نعال 😐🍃" 

ws[122] = "😱" 
rs[122] = "خير 😨" 

ws[123] = "حبيبي" 
rs[123] = "عيونه يعمري #مراجل احبك😍❤️"

ws[124] = "ابو الجون" 
rs[124] = "هذا ضلع مراجل شتريد منا ولك😕👟" 

ws[125] = "😳"
rs[125] = "شبيك وجه البومه😹" 

ws[126] = "خرب" 
rs[126] = "🌚❤️خالتك" 

ws[127] = "😂" 
rs[127] = "كل قوتك😹" 

ws[128] = "وين" 
rs[128] = "دقايق وارجع اهينك🌚❤️" 

ws[129] = "شنو" 
rs[129] = "ادعبل مو يمك"

ws[130] = "اي" 
rs[130] = "تعال خاص محتاجك😔🔞"

ws[131] = "تجي" 
rs[131] = "اضحك عليك🌝💚" 

ws[132] = "شسمك" 
rs[132] = "سبانه وانت😹" 

ws[133] = "عرفونه عليكم" 
rs[133] = "سبانه العمر 13 عايش والحمدالله وانته عرفنه عليك" 

ws[134] = "منو" 
rs[134] = "شكد تسال انجب و اسكت🌝💚" 

ws[135] = "تريد" 
rs[135] = "لا تصير لوكي ما اريد🌚🍃" 

ws[136] = "تشرب " 
rs[136] = "تعال نسكر ابو العرك🍻🌚" 

ws[137] = "اكطع" 
rs[137] = "كافي مشاكل خلونه متونسين خاطر ربكم😒🍂" 

ws[138] = "😌" 
rs[138] = "فديتك ورده والله🌝" 

ws[139] = "غني" 
rs[139] = "😂😂الله الله الله  الله ويا  " 

ws[140] = "خالتك" 
rs[140] = "😐😂فديت ربها" 

ws[141] = "هههه" 
rs[141] = "وين بغداد 🌚"

ws[142] = "ضوجه" 
rs[142] = "تعال نسكر 🌚🍻" 

ws[143] = "راح" 
rs[143] = "طبه مرض😕😹" 

ws[144] = "انجبي" 
rs[144] = " لا تغلط عليهه احبهه 🌝💚تره اطردك🌚🍷" 

ws[145] = "شبيك" 
rs[145] = "شبيك انكلش😹" 

ws[146] = "زاحفه"
rs[146] = "على خالتك الشكرة"

ws[147] = "القناه" 
rs[147] = "@aboshosho قناه كلشي تردون بيهه تلكون تخط مطورين و تحديثات و كذا 🌚🍷و بيهه رمزيات و هيج شي 🌝�"

ws[148] = "عركه"
rs[148] = "شبيك ملطلط😕" 

ws[149] = "طن" 
rs[149] = "لتعيدها ابن الاوادم احترم شويه😒" 

ws[150] = "تف"
rs[150] = "ليش الان اهين بيك😹"

ws[151] = "منو اني" 
rs[151] = "كلمن يعرف نفسه شعليه اني😕😹" 

ws[152] = "شنو انته" 
rs[152] = "اسال عليه وتعال مراح اكلك 👟🚶" 

ws[153] = "اتفل" 
rs[153] = "احترمه لخاطري ابو رقيه😹"

ws[154] = "حطردك" 
rs[154] = "مو بكيفك طرده 😒💚" 

ws[155] = "المطور" 
rs[155] = "تعال وره ال12 حبي🌚🔞" 

ws[156] = "ابو شهوده" 
rs[156] = "هذا الي صنعني يمه شكد احبه😍💋"

ws[157] = "شسوي" 
rs[157] = "اشوف المره شمسويه غده😕" 

ws[158] = "انته زلمه" 
rs[158] = "لا عفناها الك بقبق🐸😹" 

ws[159] = "ياهوه" 
rs[159] = "فنك اذا عرفته😹" 

ws[160] = "محضور" 
rs[160] = "محصور 😹 منو حاصرك ولك احجي😹" 

ws[161] = "منو انته" 
rs[161] = "صكارك اني حبي😹"

ws[162] = "تخليني" 
rs[162] = "كبر شنو هل الافاظ السوقيه😹😹"

ws[163] = "وينك" 
rs[163] = "شتريد يمعود اريد اروح😕"

ws[164] = "😪" 
rs[164] = "كبر عود انته الجبير😒" 

ws[165] = "هلا" 
rs[165] = "شتشرب حبي 🐬🌚" 

ws[166] = "مرحبا" 
rs[166] = "ماعندي تفاحتين ☹️" 

ws[167] = "سلام" 
rs[167] = "يا سلام النجار 😹شبيك عجوزي كملهه😒" 

ws[168] = "هلو" 
rs[168] = "نورت بعد روحي😘" 

ws[169] = "السلام عليكم" 
rs[169] = "عليكم السلام 🌝🍃" 

ws[170] = "تسلم" 
rs[170] = "الله يسلمك 😍" 

— the main function 
function run( msg, matches ) 
— just a local variables that i used in my algorithm 
local i = 0; local w = false 

— the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
— this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
for k,v in pairs(ws) do 
— change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
— assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
i = k; w = true; 
end 
end 

— check if { w } is not false and { i } not equals to 0 
if ( (w ~= false) and (i ~= 0) ) then 
— get the receiver :3 
R = get_receiver(msg) 
— send him the proper message from the index that { i } assigned to 
—send_large_msg ( R , rs[i] ); 
—send_reply(msg.id, rs[i]) 
reply_msg(msg.id, rs[i], ok_cb, false ) 
end 

— don't edit this section 
if ( msg.text == "about" ) then 
if ( msg.from.username == "Mouamle" ) then 
R = get_receiver(msg) 
send_large_msg ( R , "Made by @Mouamle" ); 
end 
end 
end 
return { 
patterns = { 
"(.*)" 
}, 
run = run 
} 
end
